# 4. Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

number = int(input('Введите десятичное число: '))       # Вводим искомое число
binarynumber = ''                                       # Заводим переменную для хранения двоичного вида числа

while number > 0:                                       # условие выполнения цикла
    binarynumber = str(number % 2) + binarynumber       # записываем в строку получаемый результат
    number = number // 2                                # делим на 2 до победного

print(binarynumber)                                     # Выводим результат

