# 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# Задать рандомный список
# сумировать элементы списка стоящие на нечетных позициях
#


from random import randint                # подключаю генерацию рандомных чисел
numbers = []                              # объявляем списко
for i in range(10):                       # создаем 10 случайных чисел
    numbers.append(randint(0, 10))        # в диапозоне от 0 до 10 
print(numbers)                            # показываем список


def SumNumbers(List):                     # создаем функция суммирования
    Summa = 0                             # переменная суммы
    for i in range(0, len(List)):         # указываем диапозон выполнения цикла
        if i % 2 != 0:                    # условие цикла (нечетная позиция в списке )
            Summa = Summa+List[i]         # складываем подходящие числа
    return Summa                          # возвращаем результат функции

print(SumNumbers(numbers))                # выводим результат 
